# вписываем while true, чтобы оно постоянно работало пока условие является правдой
while True:
    # вводим переменную, которая содержит в себе input
    user_input = input("Напиши что-то:")

    # вводим команды exit и quit, чтобы можно было быстро выйти из приложения
    if user_input.lower() == 'exit' or user_input.lower() == 'quit':
        exit(0)

    # вводим переменную с типом данных "строка"
    user_answer = user_input.capitalize()

    # тут поочередно вводим ключевые слова и ответы на них
    if user_answer == "Хай" or user_answer == "Привіт" or user_answer == "Доброго дня":
        print("Доброго вечора, я бот з України!")
    elif user_answer == "Як справи?" or user_answer == "Що робиш?" or user_answer == "Чим займаєшся?":
        print("Вчусь програмувати на Python!")
    elif user_answer == "Фільм" or user_answer == "Кінотеатр" or user_answer == "Серіал":
        print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм Володар перстнiв, він просто бомба!")
    # также в слова, которые содержат в себе "прощание" добавил функцию exit для автоматического выхода после ключевых слов
    elif user_answer == "Бувай" or user_answer == "Надобраніч" or user_answer == "Гудбай" or user_answer == "До зустрічі":
        print("Побачимось у мережі, I'll be back.")
        exit(0)
    # это если ключевых слов не найдено
    else:
        print("Дуже цікаво, але, на жаль, нічого не зрозуміло :(")




