# Привіт / Хай / Доброго дня => Доброго вечора, я бот з України!
# Як справи? / Що робиш? / Чим займаєшся? => Вчусь програмувати на Python!
#  Фільм / Кінотеатр / Серіал => Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм *ваша відповідь*, він просто бомба!
# Бувай / Надобраніч / Гудбай / До зустрічі => Побачимось у мережі, I'll be back.
# Ключових слів не знайдено* => Дуже цікаво, але, нажаль, нічого не зрозуміло :(
hello_answer = "Привіт"  "Хай"  "Доброго дня"
mood_answer = "Як справи?"  "Що робиш?" "Чим займаєшся?"
film_answer = "Фільм"  "Кінотеатр"  "Серіал"
bye_answer =  "Бувай"  "Надобраніч"  "Гудбай"  "До зустрічі"

while True:
    try:
        user_input = input("Напиши что то):")
        if user_input.lower() == 'exit':
            exit(0)
            quit(0)
        user_answer = str(user_input)
        if user_answer == "Хай" "Привіт" "Доброго дня":
            print("Доброго вечора, я бот з України!")

    except Exception:
        print('Тут должны быть только слова!')


