# Привіт / Хай / Доброго дня => Доброго вечора, я бот з України!
# Як справи? / Що робиш? / Чим займаєшся? => Вчусь програмувати на Python!
#  Фільм / Кінотеатр / Серіал => Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал/фільм *ваша відповідь*, він просто бомба!
# Бувай / Надобраніч / Гудбай / До зустрічі => Побачимось у мережі, I'll be back.
# Ключових слів не знайдено* => Дуже цікаво, але, нажаль, нічого не зрозуміло :(
# вписываем while true, чтобы оно постоянно работало пока условие является правдой
while True:
# вводим  try для того, того чтобы была инструкция из которой можна вывести исключение
    try:
# вводим переменую, которая содержит в себе input
        user_input = input("Напиши что то):")
# вводим команды exit quit, чтобы можно было быстро выйти из приложения
        if user_input.lower() == 'exit':
            exit(0)
            quit(0)
# вводим переменую с типом данных "строка"
        user_answer = str(user_input)
# тут поочередно вводим ключевы слова и ответы на них
        if user_answer == "Хай":
            print("Доброго вечора, я бот з України!")
        if user_answer == "Привіт":
            print("Доброго вечора, я бот з України!")
        if user_answer == "Доброго дня":
            print("Доброго вечора, я бот з України!")
        if user_answer == "Як справи?":
            print("Вчусь програмувати на Python!")
        if user_answer == "Що робиш?":
            print("Вчусь програмувати на Python!")
        if user_answer == "Чим займаєшся?":
            print("Вчусь програмувати на Python!")
        if user_answer == "Фільм":
            print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм Володар перстнiв, він просто бомба!")
        if user_answer == "Кінотеатр":
            print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться фільм Володар перстнiв, він просто бомба!")
        if user_answer == "Серіал":
            print("Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться cеріал Гострi козирки, він просто бомба!")
# также в слова, которые содержат в себе "прощание" добавил фунцию exit для авт. выхода после ключевых слов
       if user_answer == "Бувай":
            print("Побачимось у мережі, I'll be back.")
            exit(0)
        if user_answer == "Надобраніч":
            print("Побачимось у мережі, I'll be back.")
            exit(0)
        if user_answer == "Гудбай":
            print("Побачимось у мережі, I'll be back.")
            exit(0)
        if user_answer == "До зустрічі":
            print("Побачимось у мережі, I'll be back.")
            exit(0)
# это если ключевых слов не найдено
        else:
            print("Дуже цікаво, але, нажаль, нічого не зрозуміло :(")


    except Exception:
        print('Тут должны быть только слова!')
        continue


